korgillya/esp_32_s3_ble_kvm_switch/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

CONFIG_FREERTOS_HZ=1000
CONFIG_COMPILER_OPTIMIZATION_PERF=y

CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_COLORS=y

# BLE HID mouse peripheral for the laptop-facing side of the KVM.
CONFIG_BT_ENABLED=y
CONFIG_BT_CONTROLLER_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_SECURITY_ENABLE=y
CONFIG_BT_NIMBLE_HID_SERVICE=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=2
CONFIG_BT_NIMBLE_MAX_BONDS=2
CONFIG_BT_NIMBLE_MAX_CCCDS=16
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=64

# Persist bonds, IRK and CCCD subscriptions in NVS so paired hosts (macOS in
# particular) can reconnect after the ESP reboots without "Forget device".
CONFIG_BT_NIMBLE_NVS_PERSIST=y

# Allow ESP32-S3 USB host stack to enumerate devices behind an external USB hub.
CONFIG_USB_HOST_HUBS_SUPPORTED=y

# Some hubs/receivers need extra time before a downstream port is really usable.
CONFIG_USB_HOST_EXT_PORT_CUSTOM_POWER_ON_DELAY_ENABLE=y
CONFIG_USB_HOST_EXT_PORT_CUSTOM_POWER_ON_DELAY_MS=500

# Log every device seen during enumeration to distinguish hub-vs-receiver issues.
CONFIG_USB_HOST_ENABLE_ENUM_FILTER_CALLBACK=y
